Revit 2026 API

# ParameterTypeIdRbsElecAnalyticalLoadsInSet Property

---

"Loads in Set"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsElecAnalyticalLoadsInSet { get; }
```
```vb
Public Shared ReadOnly Property RbsElecAnalyticalLoadsInSet As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsElecAnalyticalLoadsInSet {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsElecAnalyticalLoadsInSet : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace